---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCConnectedWallDataLocation
source: html/90930859-e2e7-2204-aed0-d738af6c306d.htm
---
# Autodesk.Revit.DB.IFC.IFCConnectedWallDataLocation

An enumerated type that represents the location where an element is connected to a wall.

## Syntax (C#)
```csharp
public enum IFCConnectedWallDataLocation
```